
#include "s3c2440_soc.h"

void delay(volatile int d)
{
	while (d--);
}

int main()
{
    int val = 0;  /* val: 0b000, 0b111 */
    /*
     * 000 取反 0b111 全不亮
     * 001 取反 110   亮4号灯
     * 010 取反 101   亮5号灯
     * 011 取反 100   亮45号灯
     * 100 取反 011   亮6号灯
     * 101 取反 010   亮64 号灯
     * 110 取反 001   亮56号灯
     * 111 取反 000   全亮
	int tmp;

	/* 设置GPFCON让GPF4/5/6配置为输出引脚 */
	pGPFCON &= ~((3<<8) | (3<<10) | (3<<12)); //清除配置寄存器456 的设置
	pGPFCON |=  ((1<<8) | (1<<10) | (1<<12)); //设置配置寄存器456 为输出 

    //配置按键引脚为输出

    GPFCON &= ~((3<<0) | (3<<4));  /* gpf0,2 */ 
	GPGCON &= ~((3<<6));  /* gpg3 */ 
	/* 循环点亮 */
	while (1)
	{
		//通过if判断按键数据寄存器的值，识别按键是否按下或松开
        //通过对应按键值来赋值led数据寄存器的值
        val1 = GPFDAT;
		val2 = GPGDAT;

		if (val1 & (1<<0)) /* s2 --> gpf6 */
		{
			/* 松开 */
			GPFDAT |= (1<<6);
		}
		else
		{
			/* 按下 */
			GPFDAT &= ~(1<<6);
		}

		if (val1 & (1<<2)) /* s3 --> gpf5 */
		{
			/* 松开 */
			GPFDAT |= (1<<5);
		}
		else
		{
			/* 按下 */
			GPFDAT &= ~(1<<5);
		}

		if (val2 & (1<<3)) /* s4 --> gpf4 */
		{
			/* 松开 */
			GPFDAT |= (1<<4);
		}
		else
		{
			/* 按下 */
			GPFDAT &= ~(1<<4);
		}

    return 0;
}
